#### FamilyParameter Members

---

|  |
| --- |
| FamilyParameter Class   Methods   Properties   See Also |

The  FamilyParameter  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Causes the object to release immediately any resources it may be utilizing. (Inherited from  APIObject  .) |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | GetUnitTypeId | Gets the identifier of the unit quantifying the parameter value. |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | AssociatedParameters | The parameters from elements in the family which are associated to this parameter. |
| Public property | CanAssignFormula | Indicates if this parameter can be assigned a formula. |
| Public property | Definition | The definition. |
| Public property | Formula | The formula. |
| Public property | GUID | The globally unique identifier |
| Public property | Id | The id of the family parameter. |
| Public property | IsDeterminedByFormula | Indicates if the parameter is determined by formula. |
| Public property | IsInstance | Indicates if the parameter is instance or type. |
| Public property | IsReadOnly | Identifies if the object is read-only or modifiable. (Overrides  APIObject IsReadOnly  .) |
| Public property | IsReporting | Indicates if the parameter is a reporting parameter. |
| Public property | IsShared | Identifies if the parameter is a shared parameter. |
| Public property | StorageType | The storage type describes the type that is used internally within the parameter to store its value. |
| Public property | UserModifiable | Indicates whether the interactive user can modify the value of this parameter. |

# See Also

FamilyParameter Class

Autodesk.Revit.DB Namespace